MingXin-1102/stm32f407-weatherclock/app/board.c
#include "stm32f4xx.h"
#include "FreeRTOS.h"
#include "task.h"

#include "debug.h"
#include "lcd.h"
#include "rtc.h"
#include "delay.h"
#include "aht20.h"
void board_lowlevel_init(void)
{
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
    RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FSMC, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
    PWR_BackupAccessCmd(ENABLE);
    RCC_LSEConfig(RCC_LSE_ON);
    while(RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET);
    RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);
}
void board_init(void)
{
    tim_delay_init();
    Debug_Init(115200);
    log_printf("[SYS] Build Date: %s %s \n",__DATE__,__TIME__);
    rtc_init();
    LCD_Init();
    aht20_init();
}

// void vAssertCalled(const char *file, int line)
// {
//     portDISABLE_INTERRUPTS();
//     printf("Assert Called: %s(%d)\n", file, line);
// }

// void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
// {
//     printf("Stack Overflowed: %s\n", pcTaskName);
//     configASSERT(0);
// }

void vApplicationMallocFailedHook(void)
{
    printf("Malloc Failed\n");
    configASSERT(0);
}


